"""Test cases for pattern matching unit tests."""

TEST_CASES = [
    {
        "alphabet": "αβγδ",
        "text": "αβαβγβαβαβαβαβγ",
        "patterns": [
            ("δ", []),
            ("γδ", []),
            ("αβ", [0, 2, 6, 8, 10, 12]),
            ("αβαβ", [0, 6, 8, 10]),
        ],
    },
    {
        "alphabet": "ćąś&",
        "text": "ąćąćąćąśśśćąćąćąćąćśśśćąćś",
        "patterns": [
            ("&", []),
            ("&ś", []),
            ("ąć", [0, 2, 4, 11, 13, 15, 17, 23]),
            ("ś", [7, 8, 9, 19, 20, 21, 25]),
            ("śś", [7, 8, 19, 20]),
            ("ćąć", [1, 3, 10, 12, 14, 16, 22]),
        ],
    },
]
